# Pandas:

In [2]:
# Pandas:

import pandas as pd

In [3]:
info  = {
    "Name" : ["Satinder Singh Sall", "Soni Vaibhav Kumar", "K Santosh Reddy"],
    "CGPA" : [6.9, 7.9, 7.5]
}

df =  pd.DataFrame(info)

print(df)

                  Name  CGPA
0  Satinder Singh Sall   6.9
1   Soni Vaibhav Kumar   7.9
2      K Santosh Reddy   7.5

In [4]:
df

                  Name  CGPA
0  Satinder Singh Sall   6.9
1   Soni Vaibhav Kumar   7.9
2      K Santosh Reddy   7.5

# Series in Pandas:

In [19]:
# Series in Pandas:

s = pd.Series([1, 2, 3, 4, 5])

print(s)
print(type(s))

# index
print(s[0])
print(s[3])
print(s.index)

print("\n")

# label:
s2 = pd.Series([22, 23, 24, 25, 26], index = ["Adam", "Eve", "Bob", "Charlie", "Nick"])
print(s2)
print(s2["Nick"])
print(s2["Charlie"])
print(s2.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
4
RangeIndex(start=0, stop=5, step=1)


Adam       22
Eve        23
Bob        24
Charlie    25
Nick       26
dtype: int64
26
25
Index(['Adam', 'Eve', 'Bob', 'Charlie', 'Nick'], dtype='object')

# Series Properties:
- Homogeneous in Nature
- Vectorised Operations
- Handle Missing Values with NaN
- Mutable Values but Immutable Sizes

In [22]:
# Series Properties:

s = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])

print(s + s2)

0    11
1    22
2    33
3    44
4    55
dtype: int64

# Data Frame in Pandas:

In [27]:
# Data Frame in Pandas:

info = {
    "Name" : ["Satinder", "Vaibhav", "Santosh"],
    "Age" : [22, 19, 22],
    "CGPA" : [6.9, 7.9, 8]
}

data_frame = pd.DataFrame(info)

print(data_frame, type(data_frame))

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0 <class 'pandas.core.frame.DataFrame'>

In [28]:
data_frame

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [30]:
print(data_frame.index)
print(data_frame.columns)

RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [32]:
data = [
    {"Name": "Satinder", "Age": 22, "CGPA": 6.9},
    {"Name": "Vaibhav", "Age": 19, "CGPA": 7.9},
    {"Name": "Santosh", "Age": 22, "CGPA": 8.0}
]

df = pd.DataFrame(data)
print(df)

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [33]:
data = [
    ["Satinder", 22, 6.9],
    ["Vaibhav", 19, 7.9],
    ["Santosh", 22, 8.0]
]

df = pd.DataFrame(data, columns=["Name", "Age", "CGPA"])
print(df)

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [35]:
data = (
    ["Satinder", "Vaibhav", "Santosh"],
    [22, 19, 22],
    [6.9, 7.9, 8]
)

df = pd.DataFrame({
    "Name": data[0],
    "Age": data[1],
    "CGPA": data[2]
})

print(df)

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [37]:
import numpy as np
import pandas as pd

arr = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(arr, columns=["A", "B", "C"])

print(df)

   A  B  C
0  1  2  3
1  4  5  6

# Pandas with CSV & JSON data:

In [40]:
# Pandas with CSV & JSON data:

df = pd.read_csv("employee_data.csv")

df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

# Data Frame Methods:

In [48]:
# Data Frame Methods:

df

# 1. head() → first 5 rows
df.head()

# 2. tail() → last 5 rows
df.tail()

# 3. sample() → random rows
df.sample(3)

# 4. info() → information about dataframe
df.info()

# 5. shape → total rows & columns
df.shape

# 6. describe() → statistics summary (numerical columns)
df.describe()

# 7. columns → list of column names
df.columns

# 8. nunique() → unique values per column
df.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

# Kaggle Data Set:

In [49]:
# Kaggle Data Set:

data_frame = pd.read_csv("global_air_quality.csv")

data_frame

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403